; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph4 - mode
	image2 - mode
	image6 - mode
	thermograph1 - mode
	image5 - mode
	image3 - mode
	infrared0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph1)
	(supports instrument1 image3)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument2 thermograph4)
	(supports instrument2 image3)
	(supports instrument2 infrared0)
	(supports instrument2 image5)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Planet5 image5)
	(have_image Planet5 thermograph4)
	(have_image Phenomenon6 image5)
	(have_image Phenomenon6 thermograph1)
	(have_image Planet7 infrared0)
	(have_image Planet7 image2)
	(have_image Phenomenon8 thermograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 image3)
	(have_image Phenomenon9 image6)
	(have_image Star10 image3)
	(have_image Star10 image5)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
2. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 12
3. (turn_to satellite1 planet5 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet5)
   goals met: 0 of 12
4. (take_image satellite1 planet5 instrument2 thermograph4)
   added: (have_image planet5 thermograph4)
   goals met: 1 of 12
5. (take_image satellite1 planet5 instrument2 image5)
   added: (have_image planet5 image5)
   goals met: 2 of 12
6. (turn_to satellite1 phenomenon8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 12
7. (take_image satellite1 phenomenon8 instrument2 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 3 of 12
8. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 12
9. (turn_to satellite0 groundstation3 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 12
10. (take_image satellite1 phenomenon6 instrument2 image5)
   added: (have_image phenomenon6 image5)
   goals met: 4 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
12. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 4 of 12
13. (turn_to satellite0 planet7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet7)
   goals met: 4 of 12
14. (take_image satellite0 planet7 instrument0 image2)
   added: (have_image planet7 image2)
   goals met: 5 of 12
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 12
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 12
17. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 12
18. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 5 of 12
19. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 12
20. (take_image satellite0 phenomenon6 instrument1 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 6 of 12
21. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 12
22. (take_image satellite0 phenomenon8 instrument1 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 7 of 12
23. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 12
24. (take_image satellite0 phenomenon9 instrument1 image3)
   added: (have_image phenomenon9 image3)
   goals met: 8 of 12
25. (take_image satellite0 phenomenon9 instrument1 image6)
   added: (have_image phenomenon9 image6)
   goals met: 9 of 12
26. (turn_to satellite1 planet7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet7)
   goals met: 9 of 12
27. (take_image satellite1 planet7 instrument2 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 10 of 12
28. (turn_to satellite1 star10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star10)
   goals met: 10 of 12
29. (take_image satellite1 star10 instrument2 image3)
   added: (have_image star10 image3)
   goals met: 11 of 12
30. (take_image satellite1 star10 instrument2 image5)
   added: (have_image star10 image5)
   goals met: 12 of 12
